publish/notes/202304110045-SECURITY.cryptography.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-26 Sun 14:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Intro to Ciphers</title>
<meta name="author" content="ahnaf" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Intro to Ciphers</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org85af421">1. Assymetric Ciphers</a>
<ul>
<li><a href="#org4832fc6">1.1. RSA</a></li>
<li><a href="#org685d693">1.2. ECC</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Cryptography is the science of <code>secret</code> communication. <code>Crypto</code> means
<code>hidden,secret</code> and <code>graphy</code> denotes <code>a form of drawing, writing,
representation</code>. A crypto process involves <code>encryption</code> and
<code>decryption</code>. <i>Encrypt</i> means to make a hidden message. <i>Decrypt</i> means to
unmake a hidden message.
</p>

<p>
The process of <code>encryption</code> uses a <code>cipher</code> which is an algorithm to convert a
normal message to a secret one.
</p>

<div id="outline-container-org85af421" class="outline-2">
<h2 id="org85af421"><span class="section-number-2">1.</span> Assymetric Ciphers</h2>
<div class="outline-text-2" id="text-1">
<p>
Ciphers were the <code>encryption</code> key and the <code>decryption</code> key are
different. Knowing one key does <i>not</i> give you information about the other
key.
</p>
</div>

<div id="outline-container-org4832fc6" class="outline-3">
<h3 id="org4832fc6"><span class="section-number-3">1.1.</span> RSA</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Basics
</p>

<ul class="org-ul">
<li>RSA encryption converts your messages to numbers first; it has to cause
you can't work mathematically on text. In practice, texts are divided
into blocks and also padded.</li>

<li>It requires 2 prime numbers: <code>P</code> and <code>Q</code> where <code>P != Q</code>.</li>

<li>It needs the product of the two prime numbers: <code>N</code></li>

<li>It needs the Modular Arithmetic.</li>

<li>It needs the <i>length</i> of the the set of coprimes of <code>N</code>: <code>φ(N)</code>.</li>

<li>Which helps to generate the Encryption Number (key) (<i>E</i>).</li>

<li>The Decryption Number (key) <i>D</i> is generated using a combination of
modular arithmetic, <i>E</i>, and <code>φ(N)</code> : <code>D * E (mod φ(N)) = 1</code></li>

<li>Encryption Number (key) is <b>public</b>.</li>

<li>Decryption Number is kept <b>private</b>.</li>
</ul>


<p>
Process
</p>

<ol class="org-ol">
<li><p>
Generate two large (otherwise it is easy to break) prime numbers <code>P</code>,
<code>Q</code> and generate the product <code>N</code>.
</p>

<p>
In our example, we use smaller prime number for simplicity.
</p>

<pre class="example" id="orged7ae72">
P = 2, Q = 7.

N = 2 * 7 = 14.
</pre></li>

<li><p>
Calculate <code>φ(N)</code>.
</p>

<pre class="example" id="org94895cb">
The hard way,

List all possible numbers &lt;= N i.e. 14.
=&gt; set of numbers = [1,2,3,4,5,6,7,8,9,10,11,12,13,14]

Next, find the /coprimes/ of N.
=&gt; [1,3,5,9,11,13] are the coprimes of 14.

Length, of the set.
φ(14) = 6.

The easy way,

φ(N) = (P - 1) * (Q -1 )
     = 2 - 1 * 7 - 1
     = 6.
;)
</pre></li>

<li><p>
We generate <i>E</i> which is <b>public</b>.
</p>

<pre class="example" id="orge5ff75f">
/E/ is chosen to be a number between
1 and 6 (φ(14)) exclusive.
=&gt; [2,3,4,5] are the possible set of numbers.

coprime of 6 (φ(14))
=&gt; [1,5]

coprime of 14 (N).
=&gt; is the set mentioned before: [1,3,5,9,11,13]

We ignore 1 as its common and we are left with 5 as the only common coprime.
=&gt; /E/ = 5. ;; why does this work, essentially why does the constraints work?
</pre></li>

<li><p>
We generate <i>D</i> which is <b>private</b>.
</p>

<pre class="example" id="org837776a">
   D * E (mod φ(N)) = 1 ;; why does this work to generate D?
   =&gt; D * 5 (mod 6) = 1

   There are many possible answers for D
   =&gt; [5, 11, ...]

   We choose,
   =&gt;D = 11 because 5 would be inappropriate.
   #+END_EXAMPLE\

5. Encryption using modular arithmetic for message M to generate X.

   #+BEGIN_EXAMPLE
   M^E (mod N) = X. ;; why does this work as well?
   =&gt; M^5 (mod 14) = X.
</pre></li>

<li><p>
Decryption using modular arithmetic of X to generate M.
</p>

<pre class="example" id="orga6794cf">
X^D (mod N) = M.
=&gt; X^11 (mod 14) = M.
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-org685d693" class="outline-3">
<h3 id="org685d693"><span class="section-number-3">1.2.</span> ECC</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-11-20 Tue 00:00</p>
<p class="author">Author: ahnaf</p>
<p class="date">Created: 2025-01-26 Sun 14:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
